Repository: pkar70/Waga
Catalog: WeedQbPlug/Strings/*/Resources.resw
Source language: en_us
Languages: pl

# msgEnterNewName
source: Enter new socket name
pl: Wpisz nową nazwę gniazdka

# msgFoundNew
source: Found new paired socket
pl: Nowe gniazdko sparowane

# msgNoQRCode
source: This is not QRcode
pl: To nie jest QRcode

# msgRename
source: Rename
pl: Przemianuj

# msgScanBTnet
source: Scan Bluetooth devices?
pl: Skanować sieć Bluetooth?

# msgWantAccuTimer
source: Do you want to automatically control socket to keep battery charged?
pl: Włączyć sterowanie gniazdkiem zgodnie z poziomem naładowania?

# msgWantImport
source: Do you want to import paired devices list?
pl: Wczytać sparowane gniazdka?

# resDlgCancel
source: Cancel
pl: Pomiń

# resDlgNo
source: No
pl: Nie

# resDlgYes
source: Yes
pl: Tak

# resMsgScannerBottom
source: Camera will automatically scan QRcode\nPress the 'Back' button to Cancel
pl: Kod zostanie rozpoznany automatycznie\nUżyj 'back' by anulować

# resMsgScannerTop
source: Hold camera up to socket's QRcode
pl: Ustaw QRcode gniazdka w polu widzenia

# uiAutoOnOff.Label
source: Battery automatic
pl: Automat

# uiBattAutoOnOff.Label
source: Battery monitor
pl: Monitorowanie baterii

# uiMainPageCmdDevices.Label
source: Devices
pl: Gniazdka

# uiMainPageCreateLog.Label
source: Create Log
pl: Twórz log

# uiMainPageGoExpl.Label
source: Open explorer
pl: Katalog z logami

# uiMainPageTitle.Text
source: WEEDQB sockets
pl: Gniazdka WEEDQB

# _lang
source: en
pl: pl

# uiHelpString1.Text
source: This app can control Bluetooth smart sockets named WEEDQB, visible on Bluetooth network as BT18. There is Android app for this, but why use Android when you can use Windows? :) And this app has some features not present in official Android app (but, of course, can also lacks some of functionalities).
pl: Aplikacja służy do zarządzania smart gniazdkami WEEDQB, które są widoczne jako urządzenia Bluetooth o nazwie BT18. Istnieje aplikacja na Android, ale po co używać Android skoro można użyć Windows? :) Aplikacja nie jest "tłumaczeniem" wersji Android, ma trochę funkcjonalności których nie ma wersja Android (i może też nie mieć niektórych funkcjonalności wersji Android).

# uiHelpString2.Text
source: App doesn't use Internet - it doesn't send your data anywhere. Similar to original app, WEEDQB Button, it doesn't require you to create any account, etc.
pl: Aplikacja nie korzysta z Internet - nigdzie nie wysła żadnych danych. Podobnie jak firmowa aplikacja, WEEDQB Button, nie wymaga zakładania żadnych kont, ani nic takiego.

# uiHelpString3.Text
source: Your first step should be creating list of devices. It can be done in two different ways: by pairing device in Windows settings (PIN 1234) and running app; or by scanning Bluetooth network from app.
pl: Zacznij od stworzenia listy gniazdek. Możesz tego dokonać na dwa sposoby: parując w Ustawieniach Windows gniazdko (PIN 1234) i uruchamiając aplikację, albo uruchamiając skanowanie sieci Bluetooth z poziomu aplikacji.

# uiHelpString4.Text
source: If you have more than one device, please add them on one by one - switch device on, add it (as described above), rename device found. This is simple way to know which device is which.
pl: Jeśli masz więcej niż jedno gniazdko, sugeruję dodawanie po jednym - podłącz gniazdko do sieci, dodaj (jak powyżej opisano), zmień mu nazwę, i dodawaj następne. To najprostszy sposób rozróżnienia gniazdek.

# uiHelpString5.Text
source: By nature of these sockets, app cannot read current status of device.
pl: Niestety, gniazdka nie umożliwiają odczytania ich bieżącego stanu.

# uiHelpString6.Text
source: App can create log of commands sent to socket (i.e. switching on or off). On desktop, you can access this files clicking on Explorer button on MainPage. On phones, these files are created on your SD card, in folder Datalogs\WeedQbPlug, subfolders for each year.
pl: Aplikacja może tworzyć log (historię) włączania/wyłączania gniazdek. Na komputerze stacjonarnym, aby dostać się do tych logów, naciśnij button na dole strony aplikacji. Na telefonach, pliki są tworzone na karcie SD w katalogu Datalogs\WeedQbPlug, z podfolderami dla kolejnych lat.

# uiHelpString7.Text
source: If your Windows device has batteries (e.g., it is phone), app can automatically switch on power socket when battery level drops below 30 %, or remaining discharge time drops below 90 minuts, and switch off when it reaches 98 %. Battery level test is done every 30 minutes. Warning: to be able to check battery status, Power Saver cannot be active! You can use my other app, AccuMon, to create log of discharging history.
pl: Jeśli uzywasz Windows na urządzeniu, które ma baterie (np. na telefonie), aplikacja może automatycznie włączać gniazdko (gdy poziom naładowania spadnie < 30 %, lub gdy pozostało enegii mniej niż na 90 minut), i wyłączać (gdy naładowanie osiągnie 98 %). Kontrola stanu baterii odbywa się co 30 minut. Uwaga: aby aplikacja mogła sprawdzić stan baterii, nie może być aktywne Oszczędzanie Energii! Możesz wykorzystać moją inną aplikację, AccuMon, by stworzyć log rozładowywania urządzenia, i odpowiednio ustawić Oszczędzanie Energii.

# uiHelpString8.Text
source: Sockets described as "European" is only for CEE 7/3 socket. So, if you live in Poland, France, etc., and your sockets are European CEE 7/5, you can "convert" BT18: unscrew it, remove earth contact, and cut out two millimeters of plastic, making hole somewhat larger. But such socket doesn't have earth pin!
pl: Wersja "europejska" tego gniazdka jest tylko do CEE 7/3. W Polsce (i chyba Francji) obowiązują gniazdka CEE 7/5. Można jednak "przekonwertować" BT18: odkręć 3 śrubki, usuń blaszkę uziemienia, i powiększ (o ok. 2 mm, w stronę bolców) jedną z prostokątnych dziurek. Tak przerobione BT18 nie ma uziemienia, ale za to można włożyć do gniazdka w ścianie.

# msgCommandInClipEnd
source: (command is copied to ClipBoard)
pl: (komenda jest skopiowana do ClipBoard)

# msgCommandInClipHdr
source: From command line, use command
pl: Z command line, użyj

# msgCommandInClipOr
source: or
pl: albo

# msgAnotherInstance
source: Another instance is using Bluetooth
pl: Bluetooth jest używany przez inną instancję aplikacji
